<?php
// header
	$lang['installer'] = 'ติดตั้ง';
	$lang['Welcome'] = 'ยินดีต้อนรับ';
	$lang['Install'] = 'ติดตั้ง';
	$lang['Upgrade'] = 'อัพเกรด';
	$lang['Troubleshooter'] = 'ช่างซ่อมเครื่องจักร';
	$lang['Step'] = 'ขั้น';
	$lang['Readme'] = 'เริ่มต้น';
	$lang['Admin'] = 'ผู้ดูแลระบบ';
	$lang['Home'] = 'หน้าแรกของ';
	$lang['Install_instruct'] = 'กรุณามีข้อมูล MySQL ของคุณมีประโยชน์ ดูอัพเกรดการอัพเกรดเว็บไซต์ที่มีอยู่';
	$lang['Upgrade_instruct'] = 'การอัพเกรดจะทำให้การปรับเปลี่ยนฐานข้อมูล MySQL ของคุณ ให้แน่ใจว่าได้สำรองข้อมูลก่อนที่จะดำเนิน';
	$lang['Troubleshooter_instruct'] = 'การแก้ไขปัญหาจะตรวจสอบปัญหาที่พบบ่อยเช่นโฟลเดอร์สิทธิ์ไม่ถูกต้อง';

// intro / step 1
	$lang['WelcomeToInstaller'] = 'ยินดีต้อนรับสู่การติดตั้ง Pligg CMS!';
	$lang['Introduction'] = 'การแนะนำ';
	$lang['WelcomeToThe'] = 'ยินดีต้อนรับสู่ <a href="http://pligg.com" target="_blank">Pligg</a>, CMS ที่พันอำนาจของเว็บไซต์ชุมชน ถ้าเป็นครั้งแรกของคุณการติดตั้ง Pligg CMS โปรดอ่านทุกคำแนะนำที่ให้ไว้อย่างรอบคอบเพื่อให้คุณไม่พลาดทิศทางสำคัญใด ๆ';
	$lang['Bugs'] = 'กรุณาทำความคุ้นเคยกับบางส่วนของเอกสารที่ได้รับจากชุมชนโปรโมทที่ <a href="http://pligg.com/support/">Pligg เกื้อกูล</a> เว็บไซต์ นอกจากนี้เรายังขอแนะนำให้คุณลงทะเบียนบัญชีเพื่อที่คุณจะสามารถเข้าถึงการสนับสนุนฟรีโมดูลเครื่องมือแม่แบบและทรัพยากรที่ดีอื่น ๆ';
	$lang['Installation'] = 'การสถาปนา ';
	$lang['OnceFamiliar'] = '<p>ถ้าเป็นครั้งแรกของคุณการติดตั้ง Pligg คุณควรดำเนินการต่อในหน้านี้อย่างระมัดระวังหลังจากที่ทำตามคำแนะนำด้านล่าง หากคุณจำเป็นต้องปรับรุ่นเว็บไซต์ของคุณจากรุ่นก่อนหน้าโปรดเรียกใช้สคริปต์การอัพเกรดได้โดยคลิกที่ลิงค์อัพเกรดดังกล่าวข้างต้น คำเตือน: การใช้กระบวนการติดตั้งบนฐานข้อมูลเว็บไซต์โปรโมทที่มีอยู่จะเขียนทับเรื่องทั้งหมดและการตั้งค่าดังนั้นโปรดให้แน่ใจว่าคุณต้องการดำเนินการติดตั้งถ้าคุณเลือกที่จะดำเนินการด้านล่าง
	<ol>
		<li>เปลี่ยนชื่อแฟ้ม settings.php.default ไป settings.php</li>
		<li>เปลี่ยนชื่อแฟ้ม /languages/lang_english.conf.default ไป lang_english.conf</li>
		<li>เปลี่ยนชื่อแฟ้ม /languages/lang_thai.conf.default ไป lang_thai.conf</li>
		<li>เปลี่ยนชื่อแฟ้ม /libs/dbconnect.php.default ไป dbconnect.php</li>
		<li>เปลี่ยนชื่อ /logs.default ไดเรกทอรีเพื่อ /logs</li>
		<li>CHMOD 0777 โฟลเดอร์ต่อไปนี้:</li>
		<ol>
			<li>/admin/backup/</li>
			<li>/avatars/groups_uploaded/</li>
			<li>/avatars/user_uploaded/</li>
			<li>/cache/</li>
			<li>/languages/ (CHMOD 0777 ไฟล์ทั้งหมดที่มีอยู่ภายในโฟลเดอร์นี้)</li>
		</ol>
		<li>CHMOD 0666 แฟ้มต่อไปนี้</li>
		<ol>
			<li>/libs/dbconnect.php</li>
			<li>settings.php</li>
		</ol>
	</ol>
	ขณะนี้คุณผ่านมาส่วนที่ยากที่สุด! ดำเนินการขั้นตอนต่อไปที่จะติดตั้งลงบนเว็บฐานข้อมูล MySQL ของคุณ.</p>';

// step 2
	$lang['EnterMySQL'] = 'ป้อนการตั้งค่าฐานข้อมูล MySQL ของคุณด้านล่าง หากคุณไม่ทราบการตั้งค่าฐานข้อมูล MySQL ของคุณคุณควรตรวจสอบเอกสารของเว็บโฮสต์ของคุณหรือติดต่อได้โดยตรง';
	$lang['DatabaseName'] = 'ชื่อฐานข้อมูล';
	$lang['DatabaseUsername'] = 'ชื่อผู้ใช้ฐานข้อมูล';
	$lang['DatabasePassword'] = 'รหัสผ่านฐานข้อมูล';
	$lang['DatabaseServer'] = 'เซิร์ฟเวอร์ฐานข้อมูล';
	$lang['TablePrefix'] = 'คำนำหน้าตาราง';
	$lang['PrefixExample'] = '(ie: "pligg_" ทำให้ตารางสำหรับผู้ใช้กลายเป็น pligg_users)';
	$lang['CheckSettings'] = 'ตรวจสอบการตั้งค่า';
	$lang['Errors'] = 'กรุณาแก้ไขข้อผิดพลาดข้างต้นแล้วรีเฟรชหน้า';
	$lang['LangNotFound'] = 'ไม่พบ กรุณาลบส่วนขยายเริ่มต้น. จากไฟล์ภาษาและลองอีกครั้ง';

// step 3
	$lang['ConnectionEstab'] = 'เชื่อมต่อฐานข้อมูลที่จัดตั้งขึ้น...';
	$lang['FoundDb'] = 'ฐานข้อมูลพบว่า...';
	$lang['dbconnect'] = '\'/libs/dbconnect.php\' ได้รับการปรับปรุงเรียบร้อยแล้ว.';
	$lang['NoErrors'] = 'ไม่มีข้อผิดพลาดให้ดำเนินการต่อไปยังขั้นตอนต่อไป...';
	$lang['Next'] = 'ขั้นตอนต่อไป';
	$lang['GoBack'] = 'กลับไปลองใหม่อีกครั้ง';
	$lang['Error2-1'] = 'ไม่สามารถเขียนไป \'libs/dbconnect.php\'.';
	$lang['Error2-2'] = 'ไม่สามารถเปิด  \'/libs/dbconnect.php\' สำหรับการเขียน.';
	$lang['Error2-3'] = 'ที่เชื่อมต่อกับฐานข้อมูล แต่ชื่อฐานข้อมูลที่ไม่ถูกต้อง';
	$lang['Error2-4'] = 'ไม่สามารถเชื่อมต่อไปยังเซิร์ฟเวอร์ฐานข้อมูลโดยใช้ข้อมูลที่ให้ไว้';

// step 4
	$lang['CreatingTables'] = 'การสร้างตารางฐานข้อมูล';
	$lang['TablesGood'] = '<strong>ตารางที่ถูกสร้างขึ้นประสบความสำเร็จ!</strong>';
	$lang['Error3-1'] = '<p>มีปัญหาในการสร้างตารางเป็น</p>';
	$lang['Error3-2'] = '<p>ไม่สามารถเชื่อมต่อไปยังฐานข้อมูล</p>';
	$lang['EnterAdmin'] = '<p><strong>ใส่รายละเอียดบัญชีผู้ดูแลระบบของคุณด้านล่าง:</strong><br />กรุณาเขียนลงข้อมูลบัญชีนี้เพราะจะต้องเข้าสู่ระบบและกำหนดค่าเว็บไซต์ของคุณ</p>';
	$lang['AdminLogin'] = 'เข้าสู่ระบบผู้ดูแลระบบ';
	$lang['AdminPassword'] = 'รหัสผ่านผู้ดูแลระบบ';
	$lang['ConfirmPassword'] = 'ยืนยันรหัสผ่าน';
	$lang['AdminEmail'] = 'ผู้ดูแลระบบ E-mail';
	$lang['SiteTitleLabel'] = 'ชื่อเว็บไซต์';
	$lang['CreateAdmin'] = 'สร้างบัญชีผู้ดูแลระบบ';

// Step 5
	$lang['Error5-1'] = 'กรุณากรอกเขตข้อมูลทั้งหมดสำหรับบัญชีผู้ดูแลระบบ';
	$lang['Error5-2'] = 'ฟิลด์รหัสผ่านไม่ตรงกัน กรุณากลับไปและกลับเข้าสู่เขตข้อมูลรหัสผ่าน';
	$lang['AddingAdmin'] = 'การเพิ่มบัญชีผู้ใช้งาน...';
	$lang['InstallSuccess'] = 'การติดตั้งเสร็จสมบูรณ์!';
	$lang['InstallSuccessMessage'] = 'ขอแสดงความยินดีที่คุณได้ตั้งค่าเว็บไซต์ Pligg CMS! ในขณะที่เว็บไซต์ของคุณทำงานได้อย่างสมบูรณ์ที่จุดนี้คุณจะต้องการที่จะทำเล็ก ๆ น้อย ๆ ทำความสะอาดโดยทำตามคำแนะนำด้านล่างเพื่อความปลอดภัยของเว็บไซต์ของคุณ';
	$lang['WhatToDo'] = 'สิ่งที่ต้องทำต่อไป:';
	$lang['WhatToDoList'] = '		<li>chmod "/libs/dbconnect.php" กลับไปที่ 644 เราจะไม่จำเป็นต้องเปลี่ยนไฟล์นี้อีกครั้ง</li>
		<li><strong>ลบ</strong> ลบไดเรกทอรี "/install" จากเซิร์ฟเวอร์ของคุณถ้าคุณมีการติดตั้งเรียบร้อยแล้วจ้า</li>
		<li>เข้าสู่ระบบไปยังพื้นที่ที่ผู้ดูแลระบบใช้ข้อมูลที่ผู้ใช้ที่คุณเข้ามาจากขั้นตอนก่อนหน้า เมื่อคุณเข้าสู่ระบบในที่คุณควรจะนำเสนอด้วยข้อมูลเพิ่มเติมเกี่ยวกับวิธีการใช้งานเว็บ</li>
		<li><a href="../admin/admin_config.php">กำหนดค่าเว็บไซต์ของคุณ </a> โดยใช้พื้นที่ดูแล</li>
		<li>เยี่ยมชม <a href="http://pligg.com/support/"> โปรโมทการสนับสนุน </a> เว็บไซต์ถ้าคุณมีคำถามใด ๆ</li>';
	$lang['ContinueToSite'] = 'ดำเนินการต่อไปยังเว็บไซต์ใหม่ของคุณ';
	
// Upgrade
	$lang['UpgradeHome'] = '<p>โดยคลิกที่ปุ่มด้านล่างโปรโมทจะมีการปรับฐานข้อมูลของคุณให้เป็นรุ่นล่าสุด นอกจากนี้ยังจะเพิ่มวลีใหม่โดยท้ายข้อมูลเพิ่มเติมครั้งล่าสุดที่ด้านล่างของไฟล์ภาษาของคุณ คุณยังจะต้องอัปโหลดไฟล์ใหม่และปรับปรุงตนเองแม่แบบของคุณจะเข้ากันได้อย่างเต็มที่กับรุ่นล่าสุด</p><p>เราขอแนะนำให้คุณสำรองข้อมูลเว็บไซต์และฐานข้อมูลไปยังเครื่องคอมพิวเตอร์ของคุณก่อนที่จะดำเนินการอัพเกรดเพราะจะทำให้การเปลี่ยนแปลงที่ถาวรไปยังฐานข้อมูล MySQL ของคุณ</p>';
	$lang['UpgradeAreYouSure'] = 'คุณแน่ใจหรือว่าคุณต้องการปรับรุ่นฐานข้อมูลและไฟล์ภาษาของคุณ?';
	$lang['UpgradeYes'] = 'ดำเนินการกับการอัพเกรด';
	$lang['UpgradeLanguage'] = 'ความสำเร็จโปรโมทอัพเดตไฟล์ภาษาของคุณ ตอนนี้มันรวมถึงชิ้นล่าสุดภาษา';
	$lang['UpgradingTables'] = '<strong>การปรับฐานข้อมูล...</strong>';
	$lang['LanguageUpdate'] = '<strong>อัพเกรดไฟล์ภาษา...</strong>';
	$lang['IfNoError'] = 'ถ้ามีข้อผิดพลาดไม่ปรากฏการอัพเกรดจะเสร็จสมบูรณ์!';
	$lang['PleaseFix'] = 'กรุณาแก้ไขข้อผิดพลาดดังกล่าวข้างต้น, อัพเกรดหยุด!';
	
// Errors
	$lang['NotFound'] = 'ไม่พบ!';
	$lang['CacheNotFound'] = 'ไม่พบ! สร้างไดเรกทอรีที่เรียกว่า / แคชในไดเรกทอรีรากของคุณและตั้งค่าให้ CHMOD 777';
	$lang['DbconnectNotFound'] = 'ไม่พบ! ลอง dbconnect.php.default การเปลี่ยนชื่อเพื่อ dbconnect.php';
	$lang['SettingsNotFound'] = 'ไม่พบ! ลอง settings.php.default การเปลี่ยนชื่อเพื่อ settings.php';
	$lang['ZeroBytes'] = 'เป็น 0 ไบต์.';
	$lang['NotEditable'] = 'ไม่สามารถเขียน กรุณา CHMOD เป็น 777';
	
?>